app/controllers/links_controller.rb

UPDATE "links" SET "url" = ?, "link_type" = ?, "link_password" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["url", "https://catedras.linti.unlp.edu.ar/login/index.php"], ["link_type", 1], ["link_password", "[FILTERED]"], ["updated_at", "2023-12-11 13:45:10.816074"], ["id", 1]]
UPDATE "links" SET "link_password" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["link_password", "[FILTERED]"], ["updated_at", "2023-12-11 13:47:06.389178"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @link.update(link_params)
        if link_params[:link_password].present? && @link.private_link?
          @link.update(link_password: BCrypt::Password.create(link_params[:link_password]))

DELETE FROM "links" WHERE "links"."id" = ?  [["id", 30]]
---
  def destroy
    @link.destroy!