app/controllers/links_controller.rb

SELECT "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "visit_infos".* FROM "visit_infos" WHERE "visit_infos"."link_id" = ? AND "visit_infos"."ip_address" = ?  [["link_id", 7], ["ip_address", "127.0.0.1 "]]
SELECT "visit_infos".* FROM "visit_infos" WHERE "visit_infos"."link_id" = ? AND "visit_infos"."ip_address" = ? AND "visit_infos"."visited_at" BETWEEN ? AND ?  [["link_id", 7], ["ip_address", "127.0.0."], ["visited_at", "2023-12-06 00:00:00"], ["visited_at", "2023-12-08 23:59:59.999999"]]
SELECT COUNT(*) FROM "visit_infos" WHERE "visit_infos"."link_id" = ? AND "visit_infos"."visited_at" BETWEEN ? AND ? AND "visit_infos"."visited_at" BETWEEN ? AND ?  [["link_id", 7], ["visited_at", "2023-12-06 00:00:00"], ["visited_at", "2023-12-08 23:59:59.999999"], ["visited_at", "2023-12-06 00:00:00"], ["visited_at", "2023-12-08 23:59:59.999999"]]
INSERT INTO "links" ("url", "link_type", "expires_at", "link_password", "unique_token", "access_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT COUNT(*) FROM "visit_infos" WHERE "visit_infos"."link_id" = ? AND "visit_infos"."ip_address" = ?  [["link_id", 7], ["ip_address", "127.0.0.2"]]
---
  def show
    @link = Link.find(params[:id])
    @visit_infos = @link.visit_infos

    if params[:ip_address].present?
      @visit_infos = @visit_infos.where(ip_address: params[:ip_address])
    end

    if params[:start_date].present? && params[:end_date].present?
      start_date = Date.parse(params[:start_date])
      end_date = Date.parse(params[:end_date])
      @visit_infos = @visit_infos.where(visited_at: start_date.beginning_of_day..end_date.end_of_day)
      @days = (end_date - start_date).to_i
      @total_visits = @visit_infos.where(visited_at: start_date.beginning_of_day..end_date.end_of_day).count
    else
      @days = (Time.zone.now.to_date - @link.created_at.to_date).to_i
      @total_visits = @visit_infos.count

SELECT "links".* FROM "links" WHERE "links"."unique_token" = ? LIMIT ?  [["unique_token", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "visit_infos" ("ip_address", "visited_at", "link_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["ip_address", "127.0.0.1"], ["visited_at", "2023-12-07 12:41:28.079732"], ["link_id", 2], ["created_at", "2023-12-07 12:41:28.105387"], ["updated_at", "2023-12-07 12:41:28.105387"]]
INSERT INTO "links" ("url", "link_type", "expires_at", "link_password", "unique_token", "access_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def redirect_to_url
    link = Link.find_by_unique_token(params[:unique_token])

    if !link
      flash[:alert] = "El enlace no existe"
      redirect_to root_path
    elsif link.private?
      render "private"
      return
    elsif link.access_link()
      link.create_visit_info(request.remote_ip, Time.current)

SELECT "links".* FROM "links" WHERE "links"."unique_token" = ? LIMIT ?  [["unique_token", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "visit_infos" ("ip_address", "visited_at", "link_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["ip_address", "127.0.0.1"], ["visited_at", "2023-12-07 13:44:34.279076"], ["link_id", 4], ["created_at", "2023-12-07 13:44:34.284641"], ["updated_at", "2023-12-07 13:44:34.284641"]]
INSERT INTO "links" ("url", "link_type", "expires_at", "link_password", "unique_token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def validate_password
    link = Link.find_by_unique_token(params[:unique_token])

    if link
      if link.link_type == 'private' && params[:password] == link.link_password
        link.create_visit_info(request.remote_ip, Time.current)

INSERT INTO "links" ("link_name", "url", "link_type", "expires_at", "link_password", "unique_token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

UPDATE "links" SET "link_type" = ?, "expires_at" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["link_type", "temporal"], ["expires_at", "2023-12-09 16:00:00"], ["updated_at", "2023-12-09 19:13:02.858160"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @link.update(link_params)

DELETE FROM "links" WHERE "links"."id" = ?  [["id", 8]]
---
  def destroy
    @link.destroy!