app/controllers/visit_infos_controller.rb

  def index
    @visit_infos = VisitInfo.all
---
SELECT "visit_infos".* FROM "visit_infos"

    def set_visit_info
      @visit_info = VisitInfo.find(params[:id])
---
SELECT "visit_infos".* FROM "visit_infos" WHERE "visit_infos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]