app/models/link.rb

    def generate_unique_token
      new_token = SecureRandom.hex(3)

      while Link.exists?(unique_token: new_token)
---
SELECT "links".* FROM "links" WHERE "links"."unique_token" = ? LIMIT ?  [["unique_token", "[FILTERED]"], ["LIMIT", 1]]
SELECT 1 AS one FROM "links" WHERE "links"."unique_token" = ? LIMIT ?  [["unique_token", "[FILTERED]"], ["LIMIT", 1]]

    def self.find_by_unique_token(token)
---
SELECT "links".* FROM "links" WHERE "links"."unique_token" = ? LIMIT ?  [["unique_token", "[FILTERED]"], ["LIMIT", 1]]

    def create_visit_info(ip_address, visited_at)
      visit_infos.create(ip_address: ip_address, visited_at: visited_at)
---
INSERT INTO "visit_infos" ("ip_address", "visited_at", "link_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["ip_address", "127.0.0.1"], ["visited_at", "2023-12-09 23:25:30.716531"], ["link_id", 3], ["created_at", "2023-12-09 23:25:30.731802"], ["updated_at", "2023-12-09 23:25:30.731802"]]