app/models/link.rb

INSERT INTO "visit_infos" ("ip_address", "visited_at", "link_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["ip_address", "127.0.0.1"], ["visited_at", "2023-12-11 13:51:46.484406"], ["link_id", 4], ["created_at", "2023-12-11 13:51:46.496003"], ["updated_at", "2023-12-11 13:51:46.496003"]]
---
  def create_visit_info(ip_address, visited_at)
    visit_infos.create(ip_address: ip_address, visited_at: visited_at)