app/models/user.rb

SELECT "users".* FROM "users" WHERE (lower(username) = 'admin@admin.admin' OR lower(email) = 'admin@admin.admin') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (lower(username) = 'pepito' OR lower(email) = 'pepito') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def self.find_for_database_authentication(warden_conditions)
       conditions = warden_conditions.dup
       if (login = conditions.delete(:login))
         where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", { :value => login.downcase }]).first
       elsif conditions.has_key?(:username) || conditions.has_key?(:email)
         where(conditions.to_h).first